#include<stdio.h>
int main()
{
	int i,j,k,medium;        			  	//循环中的循环变量可以在独立的循环中多次使用 
	float sum;
	float s[5][5]=
	{
	{90,78,84,80},
	{98,86,91,85},
	{85,95,99,79},
	{88,92,72,65},
	{60,89,75,82}
	};
	for(i=0;i<=4;i++)
	{
		sum=0;                				//每算完一次一行的平均分后对平均分后对成绩和赋初值 
		for(j=0;j<=3;j++)
		{
			sum=sum+s[i][j];      	 		//该同学的成绩和 
		}
		s[i][4]=sum/4;       				//求平均分 
	}
	for(k=0;k<=3;k++)    					//冒泡   循环外部的循环次数=数字个数-1 
	{
		for(i=0;i<=3-k;i++) 				//      循环内部的循环次数=循环外部的循环次数-外循环变量 
		{
			if(s[i][4]<s[i+1][4])			//因为要从大到小排列，所以如果号小的分高，就要和号大的换顺序。 
			{
				for(j=0;j<=4;j++)
				{
					medium=s[i][j];     	//以下三列为两个比较的同学的所有成绩进行互换 
					s[i][j]=s[i+1][j];
					s[i+1][j]=medium;	
				}
			}
		}
	}
	printf("编号  课程1  课程2  课程3  课程4  平均分\n");//显示成绩
	for(i=0;i<=4;i++)						 
	{
		printf("学生%d ",i+1);
		for(j=0;j<=4;j++)          			
		{ 
			printf("%.2f  ",s[i][j]);
		}
		printf("\n");
	}
}
